''' άσκηση από το από το http://pythonies.mysch.gr/chapters/planets.pdf 

Ο Ηλεκτρικός της Αθήνας εγκαινιάστηκε το 1869 και συνέδεε τον Πει-
ραιά με το Θησείο. Μετά από 88 χρόνια η διαδρομή επεκτάθηκε μέχρι την
Κηφισιά. Σήμερα αριθμεί 24 σταθμούς.

Υλοποιήστε ένα πρόγραμμα που θα βοηθά το χρήστη να μετακινηθεί με
τον Ηλεκτρικό. Ο χρήστης θα δίνει το όνομα του σταθμού από τον οποίο
θ’ αναχωρήσει και το όνομα του σταθμού στον οποίο θέλει να φτάσει
και το πρόγραμμα θα του εμφανίζει την κατεύθυνση που θα ακολουθήσει
(προς Πειραιά ή προς Κηφισιά) και τα ονόματα όλων των ενδιάμεσων
σταθμών της διαδρομής.

Ένα παράδειγμα αλληλεπίδρασης με το πρόγραμμα:

Δώστε σταθμό αφετηρίας
ΠΕΤΡΑΛΩΝΑ
Δώστε σταθμό προορισμού
ΦΑΛΗΡΟ
Σταθμοί από ΠΕΤΡΑΛΩΝΑ προς ΦΑΛΗΡΟ με κατεύθυνση ΠΕΙΡΑΙΑΣ
ΤΑΥΡΟΣ
ΚΑΛΛΙΘΕΑ
ΜΟΣΧΑΤΟ

Μετά την εμφάνιση των πληροφοριών, το πρόγραμμα θα ρωτάει το χρή-
στη αν επιθυμεί πληροφορίες για κάποια άλλη διαδρομή και θα επανα-
λαμβάνει τη διαδικασία σε περίπτωση καταφατικής απάντησης.
'''

stations = [
    "ΠΕΙΡΑΙΑΣ", 	
    "ΦΑΛΗΡΟ",  	
    "ΜΟΣΧΑΤΟ",  	
    "ΚΑΛΛΙΘΕΑ",  	
    "ΤΑΥΡΟΣ",  	
    "ΠΕΤΡΑΛΩΝΑ",  	
    "ΘΗΣΕΙΟ",  	
    "ΜΟΝΑΣΤΗΡΑΚΙ",  	
    "ΟΜΟΝΟΙΑ",  	
    "ΒΙΚΤΩΡΙΑ",  	
    "ΑΤΤΙΚΗ",  	
    "ΑΓΙΟΣ ΝΙΚΟΛΑΟΣ", 
    "ΚΑΤΩ ΠΑΤΗΣΙΑ",  	
    "ΑΓΙΟΣ ΕΛΕΥΘΕΡΙΟΣ",  	
    "ΑΝΩ ΠΑΤΗΣΙΑ",  	
    "ΠΕΡΙΣΣΟΣ",  	
    "ΠΕΥΚΑΚΙΑ",  	
    "ΝΕΑ ΙΩΝΙΑ",  	
    "ΗΡΑΚΛΕΙΟ",  	
    "ΕΙΡΗΝΗ",  	
    "ΝΕΡΑΤΖΙΩΤΙΣΣΑ", 
    "ΜΑΡΟΥΣΙ",  	
    "Κ.Α.Τ.",  	
    "ΚΗΦΙΣΙΑ"]

def inputWord(words, prompt, errorprompt):
    """ διαβάζει μια λέξη από το χρήστη και την επιστρέφει, 
        εξασφαλίζοντας ότι αυτή βρίσκεται στη λίστα επιτρεπτών λέξεων
        words: η λίστα επιτρεπτών λέξεων
        prompt: η προτροπή που εμφανίζεται στο χρήστη
        errorprompt: το μήνυμα σε περίπτωση λάθους
    """
    print(prompt)
    word = input().upper()
    while word not in words:
        print(errorprompt)
        print(prompt)
        word = input().upper()
    return word

while True:
    # σταθμοί αναχώρησης και τερματισμού
    departure = inputWord(stations, "Δώστε σταθμό αφετηρίας", "Ανύπαρκτος σταθμός")
    destination = inputWord(stations, "Δώστε σταθμό προορισμού", "Ανύπαρκτος σταθμός")
    # θέσεις (δείκτες) των σταθμών αυτών
    depIndex = stations.index(departure)
    dstIndex = stations.index(destination)
    # υπολογισμός κατεύθυνσης και ενδιάμεσων σταθμών
    if depIndex < dstIndex:
        terminal = stations[-1]
        route = stations[depIndex+1:dstIndex]
    else:
        terminal = stations[0]
        route = stations[depIndex-1:dstIndex:-1]
    # εμφάνιση πληροφοριών  
    print("\nΕνδιάμεσοι σταθμοί από", departure, "προς", destination, "με κατεύθυνση", terminal)
    for station in route:
        print(station)
    # συνέχεια
    print("Επιθυμείτε πληροφορίες για κάποια άλλη διαδρομή;")
    if input().upper() in ["Ο", "ΟΧΙ", "N", "No"]:
        break
print("Καλές διαδρομές.")

