''' άσκηση από το από το http://pythonies.mysch.gr/chapters/planets.pdf 

Στο παιχνίδι της αντιστροφής, εμφανίζεται στον παίκτη μια λίστα με
αριθμούς κι εκείνος καλείται να τους αναδιατάξει σε αύξουσα σειρά. Το
μόνο πράγμα που καθορίζει ο παίκτης σε κάθε κίνησή του είναι πόσοι
αριθμοί θ’ αντιστραφούν (ξεκινώντας από τ’ αριστερά).

Για παράδειγμα, αν οι αριθμοί είναι:
2 3 4 5 1 6 7 8 9

και ο παίκτης επιλέξει ν’ αντιστρέψει τέσσερις αριθμούς, τότε οι αριθμοί
θα γίνουν:
5 4 3 2 1 6 7 8 9

Αν στη συνέχεια ο παίκτης αντιστρέψει πέντε αριθμούς, κερδίζει!
1 2 3 4 5 6 7 8 9

Να κατασκευάσετε πρόγραμμα που εμφανίζει στον παίκτη μια λίστα με
τους αριθμούς από το 1 μέχρι το 9 ανακατεμένους και στη συνέχεια ζητά
από τον παίκτη επαναληπτικά πόσους αριθμούς να αντιστρέψει. Το παι-
χνίδι τελειώνει όταν ο παίκτης καταφέρει να τοποθετήσει τους αριθμούς
στη σωστή σειρά ή όταν παραιτηθεί, απαντώντας ότι επιθυμεί να αντι-
στρέψει μηδέν αριθμούς. Αν ο παίκτης καταφέρει να ολοκληρώσει το παι-
χνίδι, το πρόγραμμα θα πρέπει να εμφανίζει πόσες κινήσεις χρειάστηκαν.
Όταν ολοκληρώσετε το πρόγραμμά σας, προσπαθήστε να το τροποποιή-
σετε έτσι ώστε οι κινήσεις να μην επιλέγονται από το χρήστη, αλλά από
το πρόγραμμα, το οποίο πια θα παίζει μόνο του.
'''

import random

def selectMove(current, target):
    """ επιλέγει κι επιστρέφει την επόμενη κίνηση
        current: η τρέχουσα λίστα
        target: η λίστα "στόχος"
    """
    # ξεκίνα από την τελευταία θέση...
    index = len(current)-1
    # ... μέχρι να βρεις στοιχείο εκτός θέσης
    while index >= 0 and target[index] == current[index]:
        index -= 1
    # αν υπάρχει τέτοιο στοιχείο...
    if index >= 0:
        # ... βρες που βρίσκεται αυτό στην τρέχουσα λίστα
        next = current.index(target[index])
        if next == 0:
            # αν είναι στην πρώτη θέση, βάλτο στη θέση του
            return index+1
        else:
            # διαφορετικά, βάλτο στην πρώτη θέση
            return next+1
    else:
        # οι λίστες δεν διαφέρουν πουθενά, τέλος!
        return 0

def printlist(L):
    """ εμφανίζει σε μια γραμμή τα στοιχεία της λίστας L
    """
    for element in L:
        print(element, end=" ")
    print()

# η λίστα με τους (ταξινομημένους) αριθμούς από το 1 μέχρι το 9
ordered = [number for number in range(1,10)]
# ένα ανακατεμένο αντίγραφο της λίστας
numbers = ordered.copy()
random.shuffle(numbers)

# όσο η τρέχουσα λίστα δεν ταυτίζεται με την τελική
while numbers != ordered:
    # εμφάνιση τρέχουσας λίστας    
    printlist(numbers)
    # εμφάνιση υπόδειξης
    print("  » hint:", selectMove(numbers, ordered))
    # ανάγνωση της κίνησης του παίκτη
    count = int(input("Πόσοι αριθμοί να αντιστραφούν (2-9); "))
    if count < 2 or count > 9:
        print("Τέλος παιχνιδιού.")
        break
    # αντιστροφή των πρώτων count αριθμών της τρέχουσας λίστας
    # left = numbers[:count]
    # right = numbers[count:]
    # left.reverse()
    # numbers = left + right
    numbers = numbers[count-1::-1] + numbers[count:]
else:
    print("Τα κατάφερες")
