''' επέκταση από το http://pythonies.mysch.gr/chapters/answer.pdf

Να τροποποιήσετε το πρόγραμμα του Deep Thought έτσι ώστε να ρωτάει το χρήστη για την Απάντηση, αντί να την ανακοινώνει απευθείας. Το πρόγραμμα θα ελέγχει αν ο χρήστης πράγματι γνωρίζει την Απάντηση και θα του εμφανίζει ανάλογο μήνυμα.
'''

# είσοδος ονόματος
print("Πώς σε λένε;")
name = input()

# ορισμός της Απάντησης
answer = "42"

# ο χρήστης ερωτάται για την Απάντηση
print("Λοιπόν", name, "ποια είναι η Απάντηση;")
reply = input()

# έλεγχος της Απάντησης του χρήστη
if reply == answer:
    print("Αααα, είσαι μυημένος...")
else:
    print("Άστο καλύτερα.")

