''' επέκταση από το http://pythonies.mysch.gr/chapters/answer.pdf

Μπορείτε να επεκτείνετε το πρόγραμμα του Deep Thought έτσι ώστε να
ρωτά το χρήστη ποιο είναι το έτος γέννησής του και να υπολογίζει την
ηλικία του.
'''

import time

# είσοδος ονόματος
print("Πώς σε λένε;")
name = input()
# ανάκτηση τοπικής ώρας συστήματος
hour = time.localtime().tm_hour
# εμφάνιση χαιρετισμού ανάλογα με την ώρα
if hour < 14:
    print("Καλημέρα", name)
else:
    print("Καλησπέρα", name)

# είσοδος έτους γέννησης
print("Ποια χρονιά γεννήθηκες;")
birth = int(input())
# ανάκτηση τρέχουσας χρονιάς
year = time.localtime().tm_year
# υπολογισμός ηλικίας
age = year - birth
# εμφάνιση μηνύματος ανάλογα με την ηλικία
if age < 18:
    print(name, "ήρθε η ώρα να μάθεις την Απάντηση.")
    answer = 42
    print("Η Απάντηση είναι...", answer)
else:
    print(name, "ένας ενήλικας δεν μπορεί να εκτιμήσει την Απάντηση.")
    print("Αντίο!")
