''' άσκηση από το http://pythonies.mysch.gr/chapters/answer.pdf

Υπάρχουν πολλά παιχνίδια στα οποία κάποιος σας ζητά να σκεφτείτε
έναν μυστικό αριθμό και, μετά από μερικές ερωτήσεις και υπολογισμούς,
«μαντεύει» τον αριθμό που είχατε σκεφτεί. Ένα πολύ παλιό παράδειγμα
βασίζεται σ’ ένα θεώρημα του κινέζου Sun Tzu, που έζησε κάπου ανάμεσα
στον 3ο και τον 5ο αιώνα. Ας υποθέσουμε ότι ο άγνωστος αριθμός είναι ο
x. Αν ονομάσουμε α, β και γ τα υπόλοιπα της διαίρεσης του x με το 3, το
5 και το 7 αντίστοιχα, τότε για να βρούμε τον άγνωστο αριθμό θα πρέπει
να υπολογίσουμε την τιμή της παράστασης 70α + 21β + 15γ και στη
συνέχεια να διαιρέσουμε με το 105. Το υπόλοιπο της διαίρεσης θα είναι
ο μυστικός αριθμός. Να αναπτύξετε ένα πρόγραμμα το οποίο ζητάει από
το χρήστη να σκεφτεί έναν μυστικό αριθμό από το 1 μέχρι και το 100.
Στη συνέχεια, το πρόγραμμα ρωτάει το χρήστη ποιο είναι το υπόλοιπο
της διαίρεσης αυτού του αριθμού με το 3, το 5 και το 7 και ανακοινώνει
τον μυστικό αριθμό, αφήνοντας το χρήστη έκπληκτο με τις υπερφυσικές
του ικανότητες.
'''

# εισαγωγή της βιβλιοθήκης time (για την καθυστέρηση μεταξύ των μηνυμάτων που εμφανίζουμε)
import time

# οδηγίες προς τον χρήστη
print("Σκέψου έναν αριθμό από το 1 μεχρι το 100.")
time.sleep(2)
print("Πάμε στοίχημα ότι μπορώ να τον μαντέψω;")
time.sleep(2)

# ερωτήσεις για τα υπόλοιπα των διαρέσεων με το 3, το 5 και το 7
print("Πες μου το υπόλοιπο της διαίρεσης του αριθμού με το 3:")
a = int(input())
print("Πες μου το υπόλοιπο της διαίρεσης του αριθμού με το 5:")
b = int(input())
print("Πες μου το υπόλοιπο της διαίρεσης του αριθμού με το 7:")
c = int(input())

# υπολογισμός της παράστασης (70α + 21β + 15γ), υπολοιπο διαίρεσης με το 105
print("Και ο αριθμός που έχεις στο μυαλό σου είναι...")
time.sleep(2)
number = (70 * a + 21 * b + 15 * c) % 105
print("To",number,"!!!")
