import random
# αρχικό πλήθος σπίρτων
matches = random.randint(7,21)
# εμφάνιση αρχικού πλήθους σπίρτων
print("Αρχικό πλήθος σπίρτων:", matches)
# ορισμός παίκτη που θα παίξει πρώτος
player = 1
# επανάληψη: συνεχίζεται μέχρι να μείνει ένα σπίρτο
while matches > 1:
    # ανάγνωση σπίρτων που θα πάρει ο παίκτης
    print("Παίκτη", player, "πόσα σπίρτα θέλεις;")
    removed = int(input())
    # μείωση σπίρτων
    matches = matches - removed
    # εμφάνιση πλήθους σπίρτων που απομένουν
    print("Σπίρτα που απομένουν:", matches)
    # εναλλαγή παίκτη
    if player == 1:
        player = 2
    else:
        player = 1
# εμφάνιση αποτελέσματος παιχνιδιού
print("Παίκτη", player, "έχασες!")
