# είσοδος ημερομηνίας από το χρήστη
print("Έτος: ", end="")
year = int(input())
print("Mήνας: ", end="")
month = int(input())
print("Ημέρα: ", end="")
day = int(input())
# υπολογισμός ημέρας με την μέθοδο του Gauss
# προσαρμογή μήνα και έτους 2 μήνες προς τα πίσω
month = ((month + 9) % 12) + 1
year = year - (month//11)
# υπολογισμός ημέρας της εβδομάδας
leap = 5*(year%4) + 4*(year%100) + 6*(year%400)
# υπολογισμός ημέρας της εβδομάδας
weekday = (day + int(2.6 * month - 0.2) + leap) % 7
# εμφάνιση ημέρας της εβδομάδας (0:Κυριακή - 6:Σάββατο)
print(weekday)
