import random
def midNumber(a,b):
    """ επιλέγει τον μεσαίο αριθμό 
    μεταξύ των a και b και τον επιστρέφει.
    a, b: όρια για τον αριθμό
    """
    # εμφάνιση προτροπής
    print("Μάντεψε τον αριθμό:", a , "-", b)
    # υπολογισμός μεσαίου αριθμού
    num = (a + b) // 2
    print("Ο υπολογιστής επιλέγει:", num)
    # επιστροφή αριθμού
    return num
# οι μεταβλητές low και high είναι τα όρια 
# ανάμεσα στα οποία βρίσκεται ο μυστικός αριθμός
low = 1
high = 32
# δημιουργία τυχαίου μυστικού αριθμού
secret = random.randint(low,high)
# ο μυστικός αριθμός δεν έχει εντοπιστεί
found = False
# ορισμός μέγιστου πλήθους προσπαθειών
tries = 4
# επανάληψη: τερματίζεται όταν
#   βρεθεί ο αριθμός ή εξαντληθούν οι προσπάθειες
while not found and tries > 0:
    # εμφάνιση και μείωση προσπαθειών
    print("Απομένουν", tries, "προσπάθειες.")
    tries = tries - 1
    # επιλογή αριθμού από το ίδιο το πρόγραμμα
    number = midNumber(low,high)
    # έλεγχος αριθμού και εμφάνιση μηνύματος
    if number > secret:
        print("Λάθος. Είναι μικρότερος.")
        high = number - 1
    elif number < secret:
        print("Λάθος. Είναι μεγαλύτερος.")
        low = number + 1
    else:
        print("Σωστά!")
        # ο μυστικός αριθμός εντοπίστηκε
        found = True
# μετά την επανάληψη
# εμφάνιση μηνύματος αν δεν έχει βρεθεί ο αριθμός.
if not found:
    print("Ήταν ο",secret)
