import random
# δημιουργία τυχαίου μυστικού αριθμού
secret = random.randint(1,32)
# ο μυστικός αριθμός δεν έχει εντοπιστεί
found = False
# ορισμός μέγιστου πλήθους προσπαθειών
tries = 4
# επανάληψη: τερματίζεται όταν
#   βρεθεί ο αριθμός ή εξαντληθούν οι προσπάθειες
while not found and tries > 0:
    # εμφάνιση και μείωση προσπαθειών
    print("Απομένουν", tries, "προσπάθειες.")
    tries = tries - 1
    # εμφάνιση προτροπής και ανάγνωση αριθμού
    print("Μάντεψε τον αριθμό: 1 - 32")
    number = int(input())
    # έλεγχος αριθμού και εμφάνιση μηνύματος
    if number != secret:
        print("Λάθος.")
    else:
        print("Σωστά!")
        # ο μυστικός αριθμός εντοπίστηκε
        found = True
# μετά την επανάληψη
# εμφάνιση μηνύματος αν δεν έχει βρεθεί ο αριθμός.
if not found:
    print("Ήταν ο", secret)
