import random
def addPluto():
    ''' Ρωτά αν ο Πλούτωνας θα θεωρηθεί πλανήτης
    κι ανάλογα επιστρέφει την τιμή True ή False
    '''
    # ερώτηση στον παίκτη για τον Πλούτωνα
    print("Nα θεωρήσουμε τον Πλούτωνα πλανήτη (ν/ο);")
    answer = input()
    # επιστροφή τιμής ανάλογα με την aπάντηση
    return answer == "Ν" or answer == "ν"
def findByName(planets):
    ''' Εμφανίζει το όνομα ενός πλανήτη και ζητά 
    από τον παίκτη τη θέση του στο ηλιακό σύστημα.
    planets: λίστα με τα ονόματα όλων των πλανητών
    '''
    # επιλογή θέσης τυχαίου πλανήτη
    nbPlanets = len(planets)
    position = random.randint(0, nbPlanets - 1)
    # αναφορά στο όνομα του πλανήτη 
    # μέσω της θέσης του στη λίστα
    planet = planets[position]
    # ερώτηση στον παίκτη
    print("Σε ποια σειρά βρίσκεται ο πλανήτης ", 
          planet, " σε σχέση με τον Ήλιο;", sep = "")
    answer = int(input())
    # έλεγχος της απάντησης του παίκτη
    if answer == position + 1:
        # αν η απάντηση είναι σωστή
        print("Μπράβο, το βρήκες!")
    else:
        # εμφάνιση της σωστής απάντησης
        print("Ο πλανήτης ", planet, " είναι ο ", 
              position + 1, "ος πλανήτης.", sep = "")
def findByPosition(planets):
    ''' Εμφανίζει τη θέση ενός πλανήτη στο ηλιακό 
    σύστημα και ζητά από τον παίκτη το όνομά του.
    planets: λίστα με τα ονόματα όλων των πλανητών
    '''
    # επιλογή τυχαίου πλανήτη
    nbPlanets = len(planets)
    position = random.randint(0, nbPlanets - 1)
    planet = planets[position]
    # ερώτηση στον παίκτη
    print("Ποιος είναι ο ", position + 1,
          "ος πλανήτης μετά τον Ήλιο;", sep = "")
    answer = input()
    # έλεγχος της απάντησης του παίκτη
    if answer == planet:
        # αν η απάντηση είναι σωστή
        print("Μπράβο, το βρήκες!")
    else:
        # εμφάνιση της σωστής απάντησης
        print("Είναι ο πλανήτης ", planet, ".", sep = "")
# η λίστα με τα ονόματα όλων των πλανητών
planets = ["Ερμής", "Αφροδίτη", "Γη", "Άρης", "Δίας",
           "Κρόνος", "Ουρανός", "Ποσειδώνας"]
# ερώτηση για προσθήκη του Πλούτωνα
if addPluto():
    # προσάρτηση του Πλούτωνα στο τέλος της λίστας
    planets.append("Πλούτωνας")
# εύρεση του πλανήτη από το όνομα
print("\nΕρώτηση 1:")
findByName(planets)
# εύρεση του πλανήτη από τη θέση
print("\nΕρώτηση 2:")
findByPosition(planets)
