''' άσκηση από το http://pythonies.mysch.gr/chapters/craps.pdf

Ο Ευκλείδης, στο έβδομο βιβλίο των Στοιχείων του, περιγράφει μια μέθοδο για την εύρεση του μέγιστου κοινού διαιρέτη δύο ακεραίων: Αφαίρεσε τον μικρότερο αριθμό από τον μεγαλύτερο και επανάλαβε τη διαδικασία μέχρι οι δύο αριθμοί να γίνουν ίσοι. Η τιμή των δύο αριθμών όταν τελειώσει η διαδικασία είναι ο μέγιστος κοινός διαιρέτης τους.

Γράψτε ένα πρόγραμμα το οποίο ζητάει από το χρήστη δύο ακέραιους αριθμούς και υπολογίζει τον μέγιστο κοινό διαιρέτη τους, χρησιμοποιώντας τη μέθοδο του Ευκλείδη.
'''

print("Πληκτρολογήστε δύο ακεραίους.")
print("Το πρόγραμμα θα υπολογίσει τον μέγιστο κοινό διαιρέτη τους.")

# είσοδος δύο ακεραίων
a = int(input())
b = int(input())

# επανάληψη: όσο οι δύο αριθμοί δεν είναι ίσοι
while a != b:
    # βρες ποιος είναι ο μικρότερος
    # και αφαίρεσέ τον από τον μεγαλύτερο
    if a < b:
        b = b - a
    else:
        a = a - b

# ανακοίνωση αποτελέσματος
print("O μέγιστος κοινός διαιρέτης είναι το", a)
