import random

def next(p):
    """ Επιστρέφει τον αριθμό του παίκτη
        που παίζει μετά τον παίκτη p.
    p: αριθμός παίκτη (1 ή 2)
    """
    return 3 - p

def readNumber():
    """ Ζητάει από το χρήστη έναν αριθμό 
        και τον επιστρέφει.
    """
    # εμφάνιση προτροπής και ανάγνωση αριθμού
    print("Μάντεψε τον αριθμό μου:", end = " ")
    num = int(input())
    # επιστροφή αριθμού
    return num

def computeNumber(a,b, tries):
    """ Επιλέγει τον μεσαίο αριθμό 
        μεταξύ των a και b και τον επιστρέφει, 
        εκτός κι αν η tries είναι ίση με 1, οπότε
        επιστρέφει έναν τυχαίο αριθμό μεταξύ των a και b.
        a, b: όρια για τον αριθμό
        tries: το πλήθος των προσπαθειών που απομένουν
    """
    # εμφάνιση προτροπής
    # print("Μάντεψε τον αριθμό:", a , "-", b)
    if tries > 1:
        # υπολογισμός μεσαίου αριθμού
        return (a + b) // 2
    else:
        # επιλογή τυχαίου αριθμού
        return random.randint(low,high)

# προετοιμασία προγράμματος:

# οι μεταβλητές low και high είναι τα όρια 
# ανάμεσα στα οποία βρίσκεται ο μυστικός αριθμός
# του χρήστη
low = 1
high = 32
# δημιουργία τυχαίου μυστικού αριθμού για το πρόγραμμα
secret = random.randint(low,high)

# προετοιμασία παιχνιδιού:

# κανένας μυστικός αριθμός δεν έχει εντοπιστεί
found = False
# ορισμός μέγιστου πλήθους προσπαθειών
tries = 9
# επιλογή παίκτη-υπολογιστή
computer = random.randint(1,2)
# ορισμός παίκτη που θα παίξει πρώτος
player = 1

# επανάληψη: τερματίζεται όταν
#   βρεθεί ο ένας αριθμός ή εξαντληθούν οι προσπάθειες
while not found and tries > 1:

    # επιλογή κίνησης, ανάλογα με τον παίκτη
    if player == computer:
        # εμφάνιση και μείωση προσπαθειών
        print("\nΜου απομένουν", tries // 2, "προσπάθειες.")
        tries = tries - 1

        # επιλογή αριθμού από το ίδιο το πρόγραμμα
        number = computeNumber(low, high, tries // 2)
        print("Επιλέγω τον αριθμό", number)
        # o χρήστης αξιολογεί τον μυστικό αριθμό.
        print("Ο αριθμός σου είναι: 1. Μικρότερος 2. Μεγαλύτερος 3. Ίσος;", end=" ")
        answer = int(input())
        # έλεγχος αριθμού
        if answer == 1:
            high = number - 1
        elif answer == 2:
            low = number + 1
        else:
            print("Κέρδισα!")
            # ο μυστικός αριθμός εντοπίστηκε
            found = True
    else:
        # εμφάνιση και μείωση προσπαθειών
        print("\nΣου απομένουν", tries // 2, "προσπάθειες.")
        tries = tries - 1

        # επιλογή αριθμού από το χρήστη
        number = readNumber()
        # έλεγχος αριθμού και εμφάνιση μηνύματος
        if number > secret:
            print("Λάθος. Είναι μικρότερος.")
        elif number < secret:
            print("Λάθος. Είναι μεγαλύτερος.")
        else:
            print("Σωστά, κέρδισες!")
            # ο μυστικός αριθμός του προγράμματος εντοπίστηκε
            found = True

    # εναλλαγή παίκτη
    player = next(player)

# μετά την επανάληψη: ανακοίνωση αποτελέσματος
if not found:
    print("Ο μυστικός αριθμός μου ήταν ο", secret)

# μια παραλλαγή θα ήταν η δυνατότητα ισοπαλίας: δηλαδή αν ο πρώτος παίκτης του γύρου το βρει, να δίνεται η δυνατότητα και στον άλλο να το βρει
