''' άσκηση από το http://pythonies.mysch.gr/chapters/guess.pdf

Να κατασκευάσετε ένα πρόγραμμα το οποίο θα ζητά από το χρήστη έναν
αλφαριθμητικό κωδικό. Ο χρήστης θα έχει το πολύ τρεις προσπάθειες για
να εισάγει τον κωδικό του. Αν εισάγει έναν σωστό κωδικό, το πρόγραμμα
θα τον καλωσορίζει, ενώ αν εξαντλήσει ανεπιτυχώς τις προσπάθειές του,
θα εμφανίζεται ένα σχετικό μήνυμα.
'''

secret = "43215678"
tries = 3
found = False

while not found and tries > 0:
    print("Απομένουν",tries,"προσπάθειες")
    tries = tries - 1
    print("Δώσε το συνθηματικό")
    userpwd = input()

    if secret == userpwd:
        print("Καλώς ήρθες")
        found = True
    else:
        print("Λάθος.")

if not found:
    print("Εξάντλησες όλες σου τις προσπάθειες")
